import React from 'react'

const Blockchain = () => {
    return (
        <div>
            <h1>Ինչ է բլոկչեյնը և ինչպես է այն աշխատում</h1>
            <div>
                <h2>Ընդանուր տեղեկություներ</h2>
                <ul>
                    <li>1) Բլոկչեյնը ապակենտրոնացված թվային մատյան է, որն ապահով կերպով գրանցում է գործարքների տվյալները ցանցի բազմաթիվ մասնագիտացված համակարգիչների վրա:</li>
                    <li>2) Բլոկչեյնը ապահովում է տվյալների ամբողջականությունը, քանի որ <b>կրիպտոգրաֆիան</b> և <b>կոնսենսուսի</b> մեխանիզմները դարձնում են այն անփոփոխ. դրա վրա գրանցված տեղեկատվությունը չի կարող հետադարձ կերպով փոփոխվել:</li>
                    <li>3) Blockchain-ը հիմք է հանդիսանում կրիպտոարժույթների, ինչպիսիք են Bitcoin-ը և Ethereum-ը, և կարևոր դեր է խաղում թափանցիկության, անվտանգության և վստահության բարձրացման գործում ոչ միայն ֆինանսների, այլ նաև այլ ոլորտներում:</li>
                </ul>
            </div>
            <div>
                <h2>Ի՞նչ է բլոկչեյնը:</h2>
                <p>
                    Blockchain-ը հատուկ տվյալների բազա է, որը նաև կոչվում է ապակենտրոնացված թվային մատյան: Այն աջակցվում է աշխարհի բազմաթիվ համակարգիչներով: Բլոկչեյնի տվյալները պահվում են բլոկներով՝ ժամանակագրական կարգով և պաշտպանված են կրիպտոգրաֆիայի միջոցով:
                </p>
                <p>
                    Բլոկչեյնի առաջին մոդելը ստեղծվել է 1990-ականների սկզբին, երբ համակարգչային գիտնական Ստյուարտ Հաբերը և ֆիզիկոս Վ. Սքոթ Սթորնետան որոշեցին օգտագործել ծածկագրությունը բլոկչեյնի վրա՝ թվային փաստաթղթերը կեղծումից պաշտպանելու համար:
                </p>
                <p>
                    Haber-ը և Stornetta-ն ոգեշնչեցին բազմաթիվ ծրագրավորողների և կրիպտոգրաֆիայի էնտուզիաստների, ինչը ի վերջո հանգեցրեց բիթքոյնի ստեղծմանը, որը բլոկչեյն տեխնոլոգիայի վրա հիմնված առաջին կրիպտոարժույթն էր: Այդ ժամանակից ի վեր բլոկչեյնը ձեռք է բերել ժողովրդականություն, և այժմ կրիպտոարժույթների օգտագործողների թիվը կայուն աճում է ամբողջ աշխարհում:
                </p>
                <p>
                    Բլոկչեյն տեխնոլոգիան սովորաբար օգտագործվում է կրիպտոարժույթով գործարքներ գրանցելու համար, սակայն այն նաև հարմար է այլ տեսակի թվային տվյալների գրանցման համար և կարող է կատարել մի շարք առաջադրանքներ
                </p>
            </div>
            <div>
                <h2>Ինչ է ապակենտրոնացումը բլոկչեյնում ? </h2>
                <p>Ապակենտրոնացումը բլոկչեյնում նշանակում է, որ ցանցի վերահսկման և որոշումների կայացման ուժը բաշխվում է դրա օգտատերերի միջև, այլ ոչ թե այն պահվում է մեկ անձի, օրինակ՝ կառավարության կամ կորպորացիայի կողմից: Ապակենտրոնացումը կարող է օգտակար լինել այն իրավիճակներում, երբ օգտատերերը ցանկանում են ապահովել իրենց տվյալների անվտանգությունն ու ամբողջականությունը:</p>
                <p>Ապակենտրոնացված բլոկչեյն ցանցում չկա կենտրոնական իշխանություն կամ միջնորդ, որը վերահսկում է տվյալների կամ գործարքների հոսքը: Փոխարենը, գործարքները ստուգվում և գրանցվում են համակարգիչների բաշխված ցանցի միջոցով, որոնք միասին պահպանում են ցանցի ամբողջականությունը:</p>
                <p>Միևնույն ժամանակ, բլոկչեյնը միայն տվյալների բազա չէ: Այն նաև ապահովում է տարբեր ծառայություններ, ինչպիսիք են կրիպտոարժույթները և չփոխարինվող նշանները (NFT): Դրա օգնությամբ օգտատերերը կարող են համագործակցել և գործարքներ կնքել միմյանց հետ՝ առանց կենտրոնական իշխանության մասնակցության</p>
            </div>
            <div>
                <h2>Ինչպե՞ս է աշխատում բլոկչեյնը:</h2>
                <p>Բլոկչեյնը թվային մատյան է, որն ապահով կերպով գրանցում է գործարքները երկու կողմերի միջև և պաշտպանում այդ գրառումները չարտոնված մուտքից: Գործարքների տվյալները գրանցվում են ամբողջ աշխարհից հատուկ համակարգիչների բաշխված ցանցով, որը կոչվում է հանգույցներ(node):</p>
                <p>Երբ օգտատերը նախաձեռնում է գործարք, օրինակ՝ որոշակի քանակությամբ կրիպտոարժույթ ուղարկելով մեկ այլ օգտատիրոջ, գործարքը հեռարձակվում է ցանց: Յուրաքանչյուր հանգույց այնուհետև ստուգում է գործարքի իսկությունը՝ ուսումնասիրելով թվային ստորագրությունները և այլ գործարքների տվյալները:</p>
                <p>Եթե ​​գործարքը հաստատվում է, այն ավելացվում է բլոկին այլ հաստատված գործարքների հետ միասին: Բլոկները միացվում են շղթայի մեջ՝ օգտագործելով կրիպտոգրաֆիկ մեթոդներ և ձևավորում են բլոկչեյն: Գործարքները վավերացնելու և դրանք բլոկչեյնին ավելացնելու համար օգտագործվում է կոնսենսուսի մեխանիզմ:
                    <b> Կոնսենսուսի մեխանիզմը կանոնների մի շարք է, որով հանգույցները համակարգում են իրենց գործողությունները և համաձայնության են գալիս բլոկչեյնի վիճակի և գործարքների հաստատման վերաբերյալ: </b></p>
                <p>Գործարքների գրանցումն ապահով, թափանցիկ և խափանումներին դիմակայելու համար բլոկչեյնն օգտագործում է<b>գաղտնագրություն </b> :<b> Կրիպտոգրաֆիկական ամենակարևոր մեթոդներից մեկը հեշինգն է՝ գործընթաց, որը ցանկացած չափի մուտքային տվյալները փոխակերպում է ֆիքսված երկարությամբ նիշերի շարանի:</b></p>
                <p>Բլոկչեյնի հեշ ֆունկցիաները պաշպանվածեն հարձակումներից: Սա նշանակում է, որ նույն արդյունքը բերող երկու տվյալների հայտնաբերման հավանականությունը աներևակայելի ցածր է: Ավելին, մուտքային տվյալների ցանկացած փոփոխություն ամբողջությամբ կփոխի հեշինգի արդյունքը:</p>
                <p>Եկեք նայենք դրան՝ օգտագործելով Bitcoin հեշ ֆունկցիան, որը կոչվում է SHA256 որպես օրինակ: Նույնիսկ եթե դուք պարզապես փոխեք տառերի մեծատառը, արդյունքը բոլորովին այլ կլինի։ Այնուամենայնիվ, հեշ գործառույթները կարող են լինել միայն միակողմանի. հեշինգի արդյունքը չի կարող օգտագործվել մուտքային տվյալները վերակառուցելու համար:</p>
                <table border={1}>
                    <thead>
                        <th>Մուտքագրեք տվյալներ</th>
                        <th>SHA256-ի միջոցով փոխանցված տվյալների ելք</th>
                    </thead>
                    <tbody>
                        <tr>
                            <td>MindEngine academy</td>
                            <td>886c5fd21b403a139d24f2ea1554ff5c0df42d5f873a56d04dc480808c155af3</td>
                        </tr>
                        <tr>
                            <td>MindEngine academy</td>
                            <td>4733a0602ade574551bf6d977d94e091d571dc2fcfd8e39767d38301d2c459a7</td>
                        </tr>
                        <tr>
                            <td>MindEngine academy</td>
                            <td>a780cd8a625deb767e999c6bec34bc86e883acc3cf8b7971138f5b25682ab181</td>
                        </tr>
                    </tbody>
                </table>
                <p>
                   <b> Բլոկչեյնի յուրաքանչյուր բլոկ պարունակում է նախորդ բլոկի հեշը՝ այդպիսով ստեղծելով բլոկների հուսալի շղթա: Եթե ​​ինչ-որ մեկը ցանկանում է փոխել մեկ բլոկ, նա պետք է փոխի բոլոր հաջորդ բլոկները, և դա ոչ միայն դժվար է, այլև աներևակայելի թանկ:</b>
                </p>
                <p>
                    Մեկ այլ կրիպտոգրաֆիկ մեթոդ, որը հաճախ օգտագործվում է բլոկչեյնում, հանրային բանալիների ծածկագրումն է կամ ասիմետրիկ ծածկագրությունը: Այն օգնում է օգտատերերի միջև անվտանգ և ստուգելի գործարքներ հաստատել:
                </p>
                <p>
                    Այն աշխատում է այսպես. Յուրաքանչյուր օգտվող ունի եզակի զույգ բանալիներ՝ մասնավոր բանալի <b>PRIVATE KEY</b>, որը պետք է գաղտնի մնա, և հանրային բանալին<b>PUBLIC KEY</b>, որը հասանելի է հանրությանը: Երբ օգտատերը գործարք է նախաձեռնում, այն ստորագրում է իր անձնական բանալիով` ստեղծելով թվային ստորագրություն:
                </p>
                <p>
                    Այնուհետև ցանցի այլ օգտվողներ կարող են ստուգել գործարքի իսկությունը՝ թվային ստորագրության վրա կիրառելով ուղարկողի հանրային բանալին<b>PUBLIC KEY</b>: Այս մոտեցումը ապահովում է գործարքի անվտանգությունը, քանի որ միայն մասնավոր բանալու <b>PRIVATE KEY</b> իրական սեփականատերը կարող է գործարք սկսել, բայց յուրաքանչյուրը կարող է ստուգել ստորագրությունները՝ օգտագործելով հանրային բանալին<b>PUBLIC KEY</b>:
                </p>
                <p>
                    Ըստ այդմ՝ բլոկչեյնի մեկ այլ հատկանիշ թափանցիկությունն է։ Յուրաքանչյուրը կարող է ստուգել բլոկչեյնի տվյալները հանրային կայքերում, ներառյալ բոլոր տեղեկությունները գործարքների և արգելափակումների մասին: Օրինակ, բլոկչեյնի վերանայման կայքերում դուք կարող եք տեսնել Bitcoin ցանցում երբևէ գրանցված բոլոր գործարքները, ներառյալ ուղարկողի և ստացողի ID-ները, փոխանցված գումարը և ցանկացած բիթքոյնի սեփականատերերի ցուցակը: Հնարավոր է նաև հետևել բլոկներին ամենավերջից (2023 թվականի մայիսի 29-ի 18:52:21 GMT-ի դրությամբ, գոյություն ունի 788,995 բլոկ) մինչև առաջինը, որը հայտնի է որպես ծագման բլոկ:
                </p>
            </div>
            <div>
                <h2>Ի՞նչ է կոնսենսուսի մեխանիզմը</h2>
                <p>
                    Համաձայնության ալգորիթմը մեխանիզմ է, որով օգտվողները և ծրագրերը կարող են համակարգել իրենց գործողությունները բաշխված ցանցում: Այն ապահովում է, որ ցանցի բոլոր մասնակիցները համաձայնության գան տվյալների ներկա վիճակի վերաբերյալ, նույնիսկ եթե որոշ հանգույցներ ձախողվեն: Այս ալգորիթմը ապահովում է, որ ցանցի բոլոր հանգույցներն ունենան մատյանների նույն պատճենը, որը պարունակում է բոլոր գործարքների գրառումը: Կոնսենսուսի մեխանիզմները բլոկչեյնների անբաժանելի մասն են, քանի որ նրանք չունեն կենտրոնական իշխանություն, որը ստուգում է գործարքները և պահպանում ցանցի ամբողջականությունը:
                </p>
                <p>
                    Երբ տասնյակ հազարավոր հանգույցներ պահում են բլոկչեյնի տվյալների պատճենը, խնդիրներ կարող են արագ առաջանալ՝ օրինակ՝ անհամապատասխան տվյալների և վնասակար հանգույցների պատճառով: Հետևաբար, բլոկչեյնի ամբողջականությունն ապահովելու համար կան կոնսենսուսի տարբեր մեխանիզմներ, որոնք որոշում են, թե ինչպես են ցանցային հանգույցները համաձայնության գալիս: Եկեք նայենք հիմնականներին.
                </p>
            </div>
            <div>
                <h2>Կոնսենսուսի մեխանիզմների տեսակները</h2>
                <h3>Proof of Work (PoW) </h3>
                <b>Proof of Work (PoW) - </b>
                <p>
                    Աշխատանքի ապացույցը (PoW) կոնսենսուսային մեխանիզմ է, որն օգտագործվում է բազմաթիվ բլոկչեյն ցանցերում՝ գործարքները վավերացնելու և բլոկչեյնի ամբողջականությունը պահպանելու համար: Սա առաջին կոնսենսուսային մեխանիզմն է, որը հայտնվել և գործում է Bitcoin-ում:
                </p>
                <p>
                    PoW-ում հանքագործները մրցում են բարդ մաթեմատիկական խնդիր լուծելու համար՝ բլոկչեյնին հաջորդ բլոկը ավելացնելու իրավունքի համար: Դրա համար նրանք հանքարդյունաբերություն են իրականացնում։ Խնդիրը լուծող առաջին հանքագործը պարգև է ստանում կրիպտոարժույթի տեսքով:
                </p>
                <p>
                    Հանքագործները պետք է օգտագործեն հզոր համակարգիչներ՝ մաթեմատիկական խնդիրներ լուծելու, նոր մետաղադրամներ ստեղծելու և ցանցն ապահովելու համար: Հետևաբար, հանքարդյունաբերության գործընթացը պահանջում է զգալի հաշվողական հզորություն և, հետևաբար, էներգիա:
                </p>
                <h3>Proof of Stake </h3>
                <b>Proof of Stake(Ցուցադրման ապացույցը) -  </b>
                <p>
                    Proof of Stake (PoS) կոնսենսուսային մեխանիզմ է, որը նախատեսված է շտկելու աշխատանքի ապացույցի (PoW) որոշ թերություններ: PoS համակարգում չկան հանքագործներ, ովքեր մրցակցում են բարդ մաթեմատիկական խնդիրներ լուծելու համար՝ գործարքները հաստատելու և բլոկչեյնին նոր բլոկներ ավելացնելու համար: Փոխարենը, համակարգը գործում է վավերացնողների(Վալիդատորներ) հետ, որոնք խաղադրույք են կատարում կրիպտոարժույթը և ընտրվում են տրամադրված գումարի հիման վրա:
                </p>
                <p>
                    Համաձայնության գործընթացին մասնակցելու համար վավերացնողները որոշակի քանակությամբ կրիպտոարժույթ են ավելացնում խաղադրույքին, այսինքն՝ այն պահում են որպես գրավ: Այնուհետև նրանք պատահականորեն ընտրվում են՝ ստեղծելու նոր բլոկներ և հաստատելու գործարքները՝ ելնելով իրենց բաժնետոմսի չափից: Նոր բլոկներ ստեղծելու համար վավերացնողները ստանում են գործարքների վճարներ, որոնք դրդում են նրանց գործել ցանցի լավագույն շահերից ելնելով:
                </p>
            </div>
            {/* <div>
                <h2>Համաձայնության այլ հանրաճանաչ մեխանիզմներ</h2>
                <p>
                    Աշխատանքի ապացույցը և ցցերի ապացույցը ամենատարածված կոնսենսուսային ալգորիթմներն են, բայց դրանք միակը չեն իրենց տեսակի մեջ: Կան բազմաթիվ այլ ալգորիթմներ. ոմանք միավորում են վերը նշված երկու համակարգերի տարրերը, իսկ մյուսները բացում են բոլորովին նոր ուղիներ կոնսենսուսի հասնելու համար:
                </p>
                <p>
                    Օրինակ, Պատվիրակված Ցուցադրման ապացույցը (DPoS) նման է PoS-ին, բայց PoS-ում բոլոր վավերացնողներն իրավունք ունեն ստեղծելու նոր բլոկներ, մինչդեռ DPoS-ում նշանների սեփականատերերն ընտրում են պատվիրակների մի շարք, ովքեր բլոկներ են ստեղծում իրենց անունից:
                </p>
                <p>
                    Իսկ լիազորությունների ապացույցը (PoA) հաշվի է առնում վավերացնողի համբավը կամ ինքնությունը, և ոչ թե նրա կրիպտոարժույթի քանակը: Վավերացնողներն ընտրվում են հուսալիության հիման վրա և կարող են հեռացվել ցանցից վնասակար գործողությունների համար:
                </p>
            </div> */}
            <div>
                <h2>Blockchain-ի առավելությունները</h2>
                <div>
                    <h3>1. Ապակենտրոնացում</h3>
                    <p>
                        Ապակենտրոնացման պատճառով բլոկչեյնում չկա վերահսկման կամ ձախողման մեկ կետ, ուստի ապակենտրոնացումը կարող է բարելավել անվտանգությունը և դիմադրությունը հարձակումներին կամ տվյալների արտահոսքին:
                    </p>
                    <h3>2. Թափանցիկություն</h3>
                    <p>
                        Բլոկչեյնով գործարքները տեսանելի են բոլորի համար, ուստի գործարքներին հետևելը և ստուգելը բավականին հեշտ է:
                    </p>
                    <h3>3.Անփոփոխելիություն</h3>
                    <p>
                        Երբ գործարքն ավելացվի բլոկչեյնին, այն հնարավոր չէ փոխել կամ ջնջել: Բայց բոլորը կարող են դիտել այն, քանի որ բլոկչեյնը պահպանում է հաստատված բոլոր գործարքների մշտական ​​գրանցում։ Սա զգալիորեն տարբերվում է ավանդական համակարգերից, որոնցում գործարքները կարող են հետաձգվել:
                    </p>
                    <h3>4.Արդյունավետություն</h3>
                    <p>
                        Բլոկչեյնով գործարքները կարող են լինել ավելի արագ և արդյունավետ, քանի որ բլոկչեյնը չի պահանջում միջնորդներ, ինչպիսիք են բանկերը:
                    </p>
                    <h3>5.Ավելի ցածր վճարներ</h3>
                    <p>
                        Բլոկչեյնը կարող է նվազեցնել գործարքների ծախսերը և բարելավել որոշ բիզնես գործառնությունների արդյունավետությունը՝ վերացնելով միջնորդներին և ավտոմատացնելով գործընթացները:
                    </p>
                    <h3>6.Չի պահանջում վստահություն</h3>
                    <p>
                        Blockchain տեխնոլոգիան թույլ է տալիս թափանցիկ գործարքներ իրականացնել, որոնք ստուգվում և հաստատվում են հենց ցանցի մասնակիցների կողմից՝ առանց պարտադրված միջնորդների:
                    </p>
                </div>
            </div>
            <div>
                <h2>Բլոկչեյն ցանցերի տեսակները</h2>
                <div>
                <h3>Հանրային բլոկչեյն</h3>
                <p>
                Հանրային բլոկչեյնը բաց ապակենտրոնացված ցանց է, որը հասանելի է բոլորին: Սովորաբար, այս ցանցերը բաց կոդով են, թափանցիկ և վստահելի, ինչը նշանակում է, որ յուրաքանչյուրը կարող է մուտք գործել և օգտագործել դրանք: Հանրային բլոկչեյնների օրինակներ են Բիթքոյնը և Էթերեումը:
                </p>
                <h3>Մասնավոր բլոկչեյն</h3>
                <p>
                Մասնավոր բլոկչեյնը, ինչպես անունն է հուշում, փակ բլոկչեյն ցանց է։ Այն սովորաբար գտնվում է մեկ կազմակերպության վերահսկողության տակ և օգտագործվում է իր նպատակների և օգտագործման համար: Մասնավոր բլոկչեյնները վերահսկում են մուտքը և սահմանում կանոններ, որոնք որոշում են, թե ով կարող է տեսնել և գրանցել գործարքները բլոկչեյնում: Նրանք ապակենտրոնացված չեն, քանի որ ունեն կառավարման հստակ հիերարխիա: Այնուամենայնիվ, դրանք կարող են բաշխվել և շատ հանգույցների հրահանգել իրենց համակարգիչների վրա պահել բլոկչեյնի պատճենը:
                </p>
                <h3>Բլոկչեյն կոնսորցիում</h3>
                <p>
                Բլոկչեյն կոնսորցիումը հանրային և մասնավոր բլոկչեյնների հիբրիդ է: Բլոկչեյն կոնսորցիումում բազմաթիվ կազմակերպություններ միավորվում են՝ ստեղծելու ընդհանուր բլոկչեյն ցանց, որը կառավարվում և վերահսկվում է համատեղ: Կախված մասնակիցների կարիքներից՝ նման ցանցերը կարող են լինել կամ բաց կամ փակ: 
                </p>
                <p>
                Ի տարբերություն բաց համակարգի, որտեղ ցանկացած օգտվող կարող է վավերացնել բլոկները, կամ փակ համակարգի, որտեղ բլոկ ստեղծողները ընտրվում են մեկ կազմակերպության կողմից, բլոկչեյն կոնսորցիումում վավերացնողները մի քանի հավասարապես հզոր կողմեր ​​են:
                </p>
                <p>
                Հետևաբար, համակարգի կանոնները ճկուն են՝ կամ բոլոր օգտատերերը, կամ միայն վավերացնողները կարող են դիտել բլոկչեյնը։ Եթե ​​վավերացնողները կարողանան կոնսենսուսի հասնել միմյանց միջև, փոփոխություններ կատարելը բավականին հեշտ է: Եվ քանի դեռ ցանցի մասնակիցների որոշակի հատված գործում է ազնիվ, բլոկչեյն համակարգը խնդիրներ չի ունենա։
                </p>
                </div>
                <button>Open HTML</button>
            </div>
        </div>
    )
}

export default Blockchain