import React from 'react'

const Pos = () => {
    return (
        <div>
            <h2>Ի՞նչ է Proof of Stake (ունեցվածքի ապացույցը) (PoS)</h2>
            <div>
                <p>
                    Proof of Stake - այն հանրաճանաչ այլընտրանք է Proof of Work-ի կոնսենսուսի ալգորիթմին: Այս մեխանիզմը չի օգտագործում համակարգիչների հաշվողական հզորությունը՝ գործարքները հաստատելու համար,
                    այլ աշխատում է  վալիդատորների կողմից սառեցված   մետաղադրամների միջոցով «staking»: Proof of Stake ը կարող է զգալիորեն նվազեցնել էներգիայի սպառումը, ինչպես նաև մեծացնել ապակենտրոնացումը, անվտանգությունը և մասշտաբայնությունը:
                </p>
                <p>
                    Այնուամենայնիվ, Proof of Stake-ը կարող է այդքան էլ հարմար չլինի այն օգտատերերի համար, ովքեր չունեն կրիպտոարժույթ, և կարող է նաև ենթարկվել հարձակման ցածր շուկայական կապիտալիզացիա ունեցող բլոկչեյնները: 51%  ցանցին տիրապետելու դեքում
                </p>
            </div>
            <div>
                <h2>Ներածություն</h2>
                <p>
                    Proof of Stake-ը այսօր ամենատարածված կոնսենսուսային ալգորիթմն է բազմաթիվ բլոկչեյն ցանցերի համար, սակայն մեծ թվով տատանումների պատճառով դա կարող է դժվար հասկանալի լինել : Ավելին, գրեթե անհնար է գտնել այս մեխանիզմն իր սկզբնական տեսքով։ Այնուամենայնիվ, Proof of Stake-ի բոլոր տեսակներն աշխատում են միևնույն հայեցակարգերի հիման վրա, ինչը կօգնի ձեզ լավագույն որոշում կայացնել բլոկչեյն ընտրելիս:
                </p>
                <h2>Ի՞նչ է նշանակում Proof of Stake </h2>
                <p>
                    Proof of Stake կոնսենսուսի ալգորիթմը ներկայացվել է 2011 թվականին Bitcointalk ֆորումում՝ նպատակ ունենալով լուծել Proof of Work ի խնդիրները: Թեև այս երկու մեխանիզմներն էլ ձգտում են կոնսենսուսի հասնել բլոկչեյնի ցանցում, նրանք դա անում են տարբեր ձևերով: Եթե ​​Proof of Work-ի օգտատերերը կատարում են հաշվողական աշխատանք, ապա  Proof of Stake ի մասնակիցներին միայն պետք է սառեցնել մետաղադրամները:
                </p>
            </div>
            <div>
                <h2>Ինչպես աշխատում Proof of Stake </h2>
                <p>
                    Proof of Stake մեխանիզմը հիմնված է պատահական ընտրության գործընթացի վրա, որը որոշում է վավերացնողին (Վալիդատորին) բլոկչեյն ցանցի մի խումբ հանգույցներից(node)ից: Դա անելու համար համակարգը օգտագործում է գործոնների համակցություն, ներառյալ մետաղադրամների տեղադրման տևողությունը (staking time), պատահականությունը և հանգույցի ֆինանսական անվտանգությունը:
                </p>
                <p>
                    Proof of Stake համակարգերում բլոկների ստեղծման համատեքստում օգտագործվում է ոչ թե Մայնինգ տերմինը, այլ ՖՈՐԺԻՆԳ տերմինը, սակայն երկու տարբերակներն էլ կարելի է գտնել: Proof of Stake կրիպտոարժույթների մեծ մասը գործարկվում է նախապես ստեղծված մետաղադրամների մատակարարմամբ, որպեսզի հանգույցները կարողանան անմիջապես սկսել աշխատել:
                </p>
                <p>
                    Բլոկի ստեղծման գործընթացին մասնակցելու համար օգտատերերը սառեցնում են իրենց մետաղադրամներ ցանցում՝ ավելացնելով դրանք խաղադրույքին(staking): Դրված մետաղադրամների քանակը մեծացնում է յուրաքանչյուր հանգույցի ընտրվելու հնարավորությունը որպես հաջորդ վալիդատոր. որքան մեծ է խաղադրույքի գումարը, այնքան մեծ են հնարավորությունները: Հանգույցների արդար ընտրություն ապահովելու համար՝  ընտրության գործընթացն օգտագործում է եզակի մեթոդներ, ինչպիսիք են բլոկի պատահական ընտրությունը և խաղադրույքի տևողության ընտրությունը:
                </p>
            </div>
            <div>
                <h2>Բլոկի պատահական ընտրություն</h2>
                <p>
                    Բլոկների պատահական ընտրության ժամանակ վավերացուցիչները որոշվում են՝  խաղադրույքի ամենամեծ քանակով: Այս դեպքում սովորաբար հնարավոր է նախապես կանխատեսել, թե ով է դառնալու հաջորդ վավերացնողը, քանի որ յուրաքանչյուր մասնակցի կողմից դրված մետաղադրամների ծավալը հասանելի է հանրությանը:
                </p>
                <h2>Ընտրություն ըստ Ստեյկինգի տևողության</h2>
                <p>
                    Ըստ Ստեյկինգի տևողության ընտրության ժամանակ վալիդատորները որոշվում են՝ ելնելով այն բանից, թե որքան ժամանակ են Սառեցված իրենց տոկեները: Տևողությունը հաշվարկվում է Սառեցրած մետաղադրամի օրերի ժամանակահտվածը բազմապատկելով դրված մետաղադրամների քանակով
                </p>
                <p>
                    Բլոկ ստեղծելուց հետո տևողությունը զրոյականացվում է, ուստի որոշ ժամանակ կպահանջվի մինչև նույն հանգույցը ընտրվի հաջորդ բլոկը ստեղծելու համար՝ թույլ չտալով հարուստ հանգույցներին գերիշխել բլոկչեյնում:
                </p>
                <h2>Գործարքի ստուգում</h2>
                <p>
                    Յուրաքանչյուր կրիպտոարժույթ՝ Proof of Stake կոնսենսուսի ալգորիթմով, ունի կանոնների և մեթոդների իր փաթեթը, որոնք ապահովում են ցանցի արդյունավետությունը:
                </p>
                <p>
                    Նոր բլոկ ստեղծելու համար ընտրված հանգույցը ստուգում է գործարքների վավերականությունը, ստորագրում է բլոկը և ավելացնում այն ​​բլոկչեյնին: Որպես պարգև՝ վավերացնողը ստանում է գործարքի վճարների մի մասը ավելացված բլոկից, իսկ որոշ բլոկչեյններում նաև պարգև՝ մետաղադրամների տեսքով։
                </p>
                <p>
                    Եթե ​​Վալիդատորը այլևս չի ցանկանում լինել բլոկ ստեղծող, նրա վաստակած պարգևները և խաղադրույքի մետաղադրամները որոշ ժամանակով արգելափակվում են: Սա հնարավորություն է տալիս համակարգին ստուգել՝ արդյոք նախաձեռնողը խարդախ բլոկներ է ավելացրել բլոկչեյնին։
                </p>
            </div>
            <div>
                <h2>Ո՞ր բլոկչեյններն են օգտագործում Proof of Stake</h2>
                <li>Ethereum 2.0. </li>
                <li>BNB Chain</li>
                <li>Solana</li>
                <li>Avalanche</li>
                <li>Polkadot</li>
            </div>
            <div>
                <h2>Proof of Stake Առավելությունները</h2>
                <b>
                    Քանի որ Proof of Stake-ը շատ առումներով գերազանցում է Proof of Work-ին, այն օգտագործվում է գրեթե բոլոր նոր բլոկչեյններում: Դրա առավելությունները ներառում են
                </b>
                <h2>Հարմարվողականություն</h2>
                <b>
                    Proof of Stake-ը ձգտում է բավարարել օգտատերերի փոփոխվող կարիքները և զարգացող բլոկչեյնը, որն արտացոլվում է ալգորիթմի նոր և բազմազան տատանումների առաջացման մեջ: Այս մեխանիզմը բազմաֆունկցիոնալ է և հարմար է բլոկչեյն առաջադրանքների մեծ մասի համար:
                </b>
                <h2>Ապակենտրոնացում</h2>
                <b>
                    Գործող հանգույցները դարձել են ավելի մատչելի, և ցանցը նպատակ ունի խրախուսել օգտվողներին գործարկել դրանք: Խրախուսման համակարգը և պատահականության գործընթացը նույնպես դարձնում են ցանցն ավելի ապակենտրոնացված:
                </b>
                <h2>Էներգաարդյունավետության</h2>
                <b>
                    Proof of Work ի համեմատ՝ Proof of Stack ի ալգորիթմը աներևակայելի էներգաարդյունավետ է: Նման մեխանիզմում մասնակցության արժեքը կախված է Ստեյկինգի տնտեսական արժեքից, այլ ոչ թե հանելուկների լուծման հաշվողական ծախսերից: Այսպիսով, այս կոնսենսուսային մեխանիզմի գործարկումը պահանջում է շատ ավելի քիչ էներգիայի ծախսեր:
                </b>
                <h2>Մասշտաբայնություն</h2>
                <b>
                    Քանի որ  Proof of Stake ը չի հիմնվում ֆիզիկական մեքենաների վրա՝ կոնսենսուսի հասնելու համար, այն ավելի լայնածավալ մեխանիզմ է: Դա չի պահանջում հսկայական Մայնինգ տնտեսություններ գնել և մեծ քանակությամբ էներգիա ծախսել: Ցանցում մի քանի վավերացուցիչներ օգտագործելը շատ ավելի էժան է, հեշտ և հասանելի:
                </b>
                <h2>Անվտանգություն</h2>
                <b>
                    Proof of Stake ը խրախուսում է Վալիդատորին ստեղծել միայն ստուգված բլոկներ: Եթե ​​ցանցը հայտնաբերի խարդախ գործարք, վավերացնողը կկորցնի իր բաժնետոմսերի մի մասը և ապագայում բլոկներ ստեղծելու իրավունքը:
                </b>
                <b>
                    Ցանցը վերահսկելու և խարդախ գործարքներ իրականացնելու համար հանգույցը պետք է ունենա ցանցի ավելի մեծ մասնաբաժին. սա կոչվում է 51% հարձակում: Այնուամենայնիվ, դա հնարավոր է անել միայն այն դեպքում, եթե դուք ձեռք բերեք շրջանառության մեջ գտնվող մետաղադրամների 51%-ը, ինչը գործնականում անհնար է:
                </b>
                <h2>Proof of Stake ի թերությունները</h2>
                <h2>Հասանելիություն</h2>
                <b>
                    Ստեյքինգի համար օգտատերերին անհրաժեշտ կլինեն բնիկ բլոկչեյն թոքեններ. դրանք կարելի է գնել փոխանակման կամ ցանկացած այլ եղանակով: Երբեմն արդյունավետ Ստեյքինգը կարող է զգալի ներդրումներ պահանջել:
                </b>
                <h2>Հարձակում 51%</h2>
                <b>
                    Չնայած Proof of Work նույնպես ենթակա է 51% հարձակումների, դրանց նկատմամբ ավելի խոցելի են Proof of Stake մեխանիզմով բլոկչեյնները: Եթե ​​նշանի գինը փլուզվի կամ բլոկչեյնը ցածր շուկայական կապիտալիզացիա ունենա, հարձակվողները տեսականորեն կարող են ձեռք բերել ավելի քան 50% նշաններ ցածր գնով և գրավել ցանցի վերահսկողությունը:
                </b>
            </div>
            <div>

            </div>
        </div>
    )
}

export default Pos