import React from 'react'
import web1 from './web1.png'
import web2 from './web2.png'
import web3 from './web3.png'
import all from './all.jpg'

const Web3Story = () => {
  return (
    <div className='Web3Story'>
      <h1>Web3-ի հասկացողությունը</h1>
      <h2>Մինչ անցնելը web3.0-ին, եկեք հասկանանք ինչ է իրենից ներկայացնում web1.0 և web2.0 հասկացողությունները </h2>
      <div className='web1'>
        <b>Web1.0 հասկացողությունը - </b>
        <p>
          Web1.0 հասկացողությունը իհայտ եկավ միայն այն  ժամանակ, երբ հայտնվեց web2.0 հասկացողությունը։  Այն ինչը տեղի էր ունեցել web2.0 ից առաջ անվանվեց web1.0:
        </p>
        <p>
          Web1-ի ժամանակահատվածը ներառում է 1991-2004թվակաները։
          Այս ժամանակահատվածում ինտերնետը իրենից ներկայացնում էր ստատիկ կայքեր որոնց կոնտենտը ստեղծվում էր ծրագրավորողների կողմից ովքեր սպասարկում էին այդ կայքերը։ Ոչ մի հետադարձ կապ օգտագործողները չէին կարող ունենալ կայքերում։(ոչ գրանցում, լոգինիզացիա կամ կոնտենտի մշակում ) :
          <br /> Web1.0 անվանում են նաև <b>read-only</b> միայն կարդալու համար։
        </p>
        <img src={web1} />
        <p>
          Ընդանրացնելով web1 ի գափարը նշենք որ ամենինչը ինչ ստեղծվում էր և մատուցվումեր օգտագործողին պահպանվում էր կենտրոնացված սերվերներում կայքերի ստեղծողների կողմից օգտագործողները ստանում էին միայն այն ինֆորմացիան որը կմատուց էին կայքի սեփականատերերը ։
        </p>
      </div>
      <div>
        <b>Web2.0 հասկացողությունը - </b>
        <p>
          Web2 տերմինը հիմնականում ասոցացվում է Թիմ Օրելիի հրապարակման հետ, <a style={{ marginRight: "10px" }} href="https://en.wikipedia.org/wiki/Tim_O%27Reilly#Web_2.0" target="_blank">what is web2.0</a>
          Հրապարակված 30.09.2005թ ին։
        </p>
        <p>
          Հիմնական կարևոր տարբերությունը web2 -ի և web1-ի մեջ դա սոցիալական կայքերի իհայտ գալն էր։ Սոցկայքերը թույլ տվեցին հրապարակումներ անել ոչ միայն ծրագրավորողներին այլ նաև բոլոր օգտագործողներին։
        </p>
        <p>
          Մենք մեր ինֆորմացիայով կիսվում ենք կայքերում իսկ կայքերի սեփականատերերը մեր ռետուրսները օգտագործում են իրենց նպատակների համար, աշխատելով գումար։
          Web2 անվանվում է նաև <b>Read-Write</b>
          (Կարդալ, գրել )

        </p>
        <img src={web2} />
        <p>
          Web2 տեխնոլոգիան նույնպես աշխատում է կենտրոնացված սերվերների վրա,  որոնք պատկանում են կոնկրետ ընկերություների։ Այլ կերպ ասած մենք մեր ռեսուրսները տրամադրում ենք Երրորդ անձին(Կազմակերպություներին) որոնք լիակատար տնօրինում են այն,
        </p>
        <p>
          <b> <h3>հենց այստեղ իհայտ է գալիս web2 ամենամեծ թերությունը։ </h3>Սոցկայքերում ինչ որ հրապարակումներ անելով դրանք գտնվում են Սոցկայքերի ղեկավարության տակ և նրանք ունեն լիակատար տնօրինելու մեր տվյալները Արգելափակել մեր կայքերը Հեռացնել հրապարակումները և այլն եթե դրանք չհամապատասխանեն այդ կազմակերպության մտածելակըրպի հետ։
            Նման պարագայում կա ավելի մեծ վտանգ մենք նայև ինտերնետով կատարում ենք գնումներ մուտքագրելով մեր անձնական տվյալները որոնք հասանելի են այդ կայքերի սեփականատերերեին և ցանկացած պահին մեր տվյալները կարող են հայտնվել հանցագործների ձեռքում։ Հենց այս խնդիրները լուծելու համար առաջ եկավ web3 Տեխնոլոգիայի մասին գաղափարը։</b>
        </p>
        <hr />
        <img src={web3} />
        <b>Web3.0 հասկացողությունը - </b>
        <p>
          Web3 գաղափարը կար դեռ տասնամյակներ առաջ, բայց նրա նկատմամբ հետաքրքրությունը աճեց վերջին տարիներին, <b>կրիպտոարժույթների</b> <b>nft</b>-երի և <b>DeFi</b>-ի հայտնիության ֆոնի վրա։  և ապագայում հենց այս տեխնոլոգիաները արդեն կօգտագործվեն այսօրվա ֆինասական համակարգի փոխարեն։
        </p>
        <p>
          Web3.0-ը սա լիովին նորարաական տեխնոլոգիաների  գաղափար է որը կփոխարինի այսօրվա մեր իմացած ինտերնետին որտեղ կօգտագործվեն բլոկչեյն տեխնոլոգիաները և բոլոր լավագույն գործիքները Ապակենտրոնացման համար
        </p>
        <h3>
          Web3 ի գործառույթները
          Հիմնականում ուղված են լինելու ներկայիս ֆինանասական Համակարգը փոխարինելու նորով, <i>DeFi</i> կազմակերպություների աշխատանքի փոփոխումը <i>DAO</i> և լիովին նոր աշխարհ կառուցելու մեջ։
        </h3>
        <h2>
          Web3 հիմնական առավելություները -
        </h2>
        <ul>
          <li>1 Ապակենտրոնացում - բոլոր ինֆորմացիաները չեն պահպանվի ինչոր կազմակերպության կոնկրետ սերվերում այն կլինի սփռված Տվյալների Բազա որը կպահպանվի տարբեր համակարգիչների մեջ։ Բլոկչեյն  տեխնոլոգիան թույլ կտա այս ֆորմատով ինֆորմացիան պահելու ինչպես նաև մասնակիցների միջև վստահության ձեռք բերմանը </li>
          <li>2 կրիպտոարժույթներ և nft-էր - սրանք կունենան կարևոր դեր նոր ինտերնետի մեջ,  քանի որ հենց այս երկուսն են իրենց վրա վերցնում թվային արժեքների պահպանման Գործը ապակենտրոնացված Բլոկչեյն ցանցում </li>
          <li>3 Վստահություն և սահմանափակման վերացում - Բոլոր ինտերնետից օգտվողները կարող են հաղորդակցվել միմիանց հետ ուղակիորեն առանց ինչ որ երրորդ անձի միջամտության:</li>
          <li>4 Բաց կոդեր - web3 ծրագրերի մեծ մասը կլինի Բաց բոլոր ծրագրավորողների և բոլոր ցանկացողների համար, Հենց թափանցիկությունը կունենա մեծ դեր կառուցելու թվային նոր աշխարհ </li>
          <li>5 Տոկենացված Կոնտենտ - ողջ կոնտենտը, որը կներբեռնեք ինտերնետ կարող է տոկենացվել և ներկայացվել որպես ntf: Այսինքն ցանկացած ձեր ստեղծած կոնտենտ կլինի ունիկալ և կհաստատի որ դուք եք նրա սեփականատերը: Պաշպանելով ձեր հեղինակային իրավունքները:</li>
          <li>6  Գրանցաման մեկ ձև - Որը կմիանա ձեր ինտերնետի բոլոր ռեսուրսներին։ այսպես ասած ձեր ստեղծած ակաունտը կարող է օգտագործվել  ոչ միայն մուտք գործելու որև է սոց կայք այլ նաև օգտագործվի դրամապանակին հասանելիություն ստանալու համար և այլն բայց այս ամենը կլինի անանուն դուք կոգտվեք ինտերնետի բոլոր ծառայություներից բայց ոչ ոք չի կարող իմանալ ձեր տվյալները</li>
          <li>7 DAO - կազմակերպություների նոր ղեկավարման մոդել : սրանք այնպիսի կազմակերպություներ են որտեղ չկան ղեկավարներ, տնօրեներ կամ սեփականատերեր Գլխավոր դերը այստեղ օգտագործողներին է որոնք ունեն ձայնի իրաունք </li>
        </ul>
      </div>
      <img src={all} />

    </div>
  )
}

export default Web3Story